#### Terraform Validation & Plan Results
* Terraform Version 📎`1.9.6`
* Working Directory 📂`./modules/test`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.ai_studio_project.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.storage_account.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m
[0m[1mmodule.setup.module.ai_studio_hub.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD05ZThjYzgyNC0yY2E3LTQwYjYtYmNmOC1hY2Y2NDg3NWQ1OGQ7b2JqZWN0SWQ9OGU5N2I5YTMtNDcxNC00ZWQ0LWIxYTYtNjY2MzhjNWRkOTQwO3N1YnNjcmlwdGlvbklkPTFmZGFiMTE4LTE2MzgtNDE5YS04YjEyLTA2Yzk1NDM3MTRhMDt0ZW5hbnRJZD0zNzk2M2RkNC1mNGU2LTQwZjgtYTdkNi0yNGI5NzkxOWU0NTI=][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_outbound_rules[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource_action" "ai_studio_hub_outbound_rules" {
      [32m+[0m[0m body                   = {
          [32m+[0m[0m properties = {
              [32m+[0m[0m managedNetwork = {
                  [32m+[0m[0m isolationMode = "AllowOnlyApprovedOutbound"
                  [32m+[0m[0m outboundRules = {
                      [32m+[0m[0m AzureOpenDatasets-TCP-443                    = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = {
                              [32m+[0m[0m action     = "Allow"
                              [32m+[0m[0m portRanges = "443"
                              [32m+[0m[0m protocol   = "TCP"
                              [32m+[0m[0m serviceTag = "AzureOpenDatasets"
                            }
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "ServiceTag"
                        }
                      [32m+[0m[0m aka-ms                                       = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "aka.ms"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-anaconda-com                             = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.anaconda.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-anaconda-org                             = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.anaconda.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-aznbcontent-net                          = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.aznbcontent.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-docker-com                               = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.docker.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-docker-io                                = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.docker.io"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-gallerycdn-vsassets-io                   = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.gallerycdn.vsassets.io"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-maven-org                                = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.maven.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-pythonhosted-org                         = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.pythonhosted.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-pytorch-org                              = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.pytorch.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-tensorflow-org                           = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.tensorflow.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-vo-msecnd-net                            = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.vo.msecnd.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-vscode-cdn-net                           = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.vscode-cdn.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-vscode-dev                               = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.vscode.dev"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-vscode-unpkg-net                         = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.vscode-unpkg.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m all-vscodeexperiments-azureedge-net          = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "*.vscodeexperiments.azureedge.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m anaconda-com                                 = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "anaconda.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m archive-ubuntu-com                           = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "archive.ubuntu.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m automlresources-prod-azureedge-net           = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "automlresources-prod.azureedge.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m azclientextensionsync-blob-core-windows-net  = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "azclientextensionsync.blob.core.windows.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m azureexamples-blob-core-windows-net          = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "azureexamples.blob.core.windows.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m azuremlexamples-blob-core-windows-net        = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "azuremlexamples.blob.core.windows.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m cdn-auth0-com                                = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "cdn.auth0.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m cdn-lfs-huggingface-co                       = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "cdn-lfs.huggingface.co"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m cloud-r-project-org                          = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "cloud.r-project.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m code-visualstudio-com                        = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "code.visualstudio.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m default-exp-tas-com                          = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "default.exp-tas.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m default-storage-queue                        = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = {
                              [32m+[0m[0m serviceResourceId = (known after apply)
                              [32m+[0m[0m sparkEnabled      = true
                              [32m+[0m[0m sparkStatus       = "Active"
                              [32m+[0m[0m subresourceTarget = "queue"
                            }
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "PrivateEndpoint"
                        }
                      [32m+[0m[0m default-storage-table                        = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = {
                              [32m+[0m[0m serviceResourceId = (known after apply)
                              [32m+[0m[0m sparkEnabled      = true
                              [32m+[0m[0m sparkStatus       = "Active"
                              [32m+[0m[0m subresourceTarget = "table"
                            }
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "PrivateEndpoint"
                        }
                      [32m+[0m[0m docker-io                                    = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "docker.io"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m ghcr-io                                      = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "ghcr.io"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m graph-microsoft-com                          = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "graph.microsoft.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m huggingface-co                               = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "huggingface.co"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m i40vsblobprodsu6weus59-blob-core-windows-net = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "i40vsblobprodsu6weus59.blob.core.windows.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m marketplace-visualstudio-com                 = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "marketplace.visualstudio.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m notebiwesteurope-blob-core-windows-net       = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "notebiwesteurope.blob.core.windows.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m openaipublic-blob-core-windows-net           = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "openaipublic.blob.core.windows.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m pkg-containers-githubusercontent-com         = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "pkg-containers.githubusercontent.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m ppa-launchpad-net                            = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "ppa.launchpad.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m production-cloudflare-docker-com             = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "production.cloudflare.docker.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m pypi-org                                     = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "pypi.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m pythonhosted-org                             = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "pythonhosted.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m pytorch-org                                  = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "pytorch.org"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m raw-githubusercontent-com                    = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "raw.githubusercontent.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m security-ubuntu-com                          = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "security.ubuntu.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m update-code-visualstudio-com                 = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "update.code.visualstudio.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m vscode-blob-core-windows-net                 = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "vscode.blob.core.windows.net"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                      [32m+[0m[0m vscode-download-prss-microsoft-com           = {
                          [32m+[0m[0m category    = "UserDefined"
                          [32m+[0m[0m destination = "vscode.download.prss.microsoft.com"
                          [32m+[0m[0m status      = "Active"
                          [32m+[0m[0m type        = "FQDN"
                        }
                    }
                  [32m+[0m[0m status        = {
                      [32m+[0m[0m sparkReady = true
                      [32m+[0m[0m status     = "Active"
                    }
                }
            }
        }
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m locks                  = []
      [32m+[0m[0m method                 = "PATCH"
      [32m+[0m[0m output                 = (known after apply)
      [32m+[0m[0m resource_id            = (known after apply)
      [32m+[0m[0m response_export_values = []
      [32m+[0m[0m type                   = "Microsoft.MachineLearningServices/workspaces@2024-04-01"
      [32m+[0m[0m when                   = "apply"
    }

[1m  # module.ai_studio_hub_outbound_rules.azapi_resource_action.ai_studio_hub_provision_managed_network[0][0m will be created
[0m  [32m+[0m[0m resource "azapi_resource_action" "ai_studio_hub_provision_managed_network" {
      [32m+[0m[0m action                 = "provisionManagedNetwork"
      [32m+[0m[0m body                   = {
          [32m+[0m[0m includeSpark = true
        }
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m method                 = "POST"
      [32m+[0m[0m output                 = (known after apply)
      [32m+[0m[0m resource_id            = (known after apply)
      [32m+[0m[0m response_export_values = []
      [32m+[0m[0m type                   = "Microsoft.MachineLearningServices/workspaces@2024-04-01"
      [32m+[0m[0m when                   = "apply"

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "60m"
        }
    }

[1m  # module.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-queue"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "ai_studio_hub_private_endpoints_approval" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "private_endpoint_name" = "default-storage-queue"
        }
    }

[1m  # module.ai_studio_hub_outbound_rules.null_resource.ai_studio_hub_private_endpoints_approval["default-storage-table"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "ai_studio_hub_private_endpoints_approval" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "private_endpoint_name" = "default-storage-table"
        }
    }

[1m  # module.ai_studio_project.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_project[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_ai_studio_project" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.ai_studio_project.azapi_resource.ai_studio_project[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "ai_studio_project" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m kind       = "Project"
          [32m+[0m[0m properties = {
              [32m+[0m[0m description   = "AI Studio Project - mbprj001"
              [32m+[0m[0m friendlyName  = "Mbprj001"
              [32m+[0m[0m hubResourceId = (known after apply)
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "northeurope"
      [32m+[0m[0m locks                     = []
      [32m+[0m[0m name                      = "mbprj001"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m response_export_values    = []
      [32m+[0m[0m schema_validation_enabled = false
      [32m+[0m[0m tags                      = {
          [32m+[0m[0m "test" = "aistudioproject"
        }
      [32m+[0m[0m type                      = "Microsoft.MachineLearningServices/workspaces@2024-04-01"

      [32m+[0m[0m identity {
          [32m+[0m[0m identity_ids = []
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.setup.module.ai_studio_hub.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_ai_studio_hub[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_ai_studio_hub" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.ai_studio_hub.azapi_resource.ai_studio_hub[0m will be created
[0m  [32m+[0m[0m resource "azapi_resource" "ai_studio_hub" {
      [32m+[0m[0m body                      = {
          [32m+[0m[0m kind       = "Hub"
          [32m+[0m[0m properties = {
              [32m+[0m[0m allowPublicAccessWhenBehindVnet = false
              [32m+[0m[0m applicationInsights             = (known after apply)
              [32m+[0m[0m containerRegistry               = (known after apply)
              [32m+[0m[0m description                     = "Azure AI Studio Hub"
              [32m+[0m[0m enableDataIsolation             = true
              [32m+[0m[0m encryption                      = [90mnull[0m[0m
              [32m+[0m[0m friendlyName                    = "Mbprj Int Aih010"
              [32m+[0m[0m hbiWorkspace                    = true
              [32m+[0m[0m imageBuildCompute               = [90mnull[0m[0m
              [32m+[0m[0m ipAllowlist                     = []
              [32m+[0m[0m keyVault                        = (known after apply)
              [32m+[0m[0m managedNetwork                  = {
                  [32m+[0m[0m isolationMode = "AllowOnlyApprovedOutbound"
                  [32m+[0m[0m outboundRules = {}
                  [32m+[0m[0m status        = {
                      [32m+[0m[0m sparkReady = true
                      [32m+[0m[0m status     = "Active"
                    }
                }
              [32m+[0m[0m primaryUserAssignedIdentity     = [90mnull[0m[0m
              [32m+[0m[0m publicNetworkAccess             = "Disabled"
              [32m+[0m[0m softDeleteRetentionInDays       = 7
              [32m+[0m[0m storageAccount                  = (known after apply)
              [32m+[0m[0m systemDatastoresAuthMode        = "identity"
              [32m+[0m[0m v1LegacyMode                    = false
            }
          [32m+[0m[0m sku        = {
              [32m+[0m[0m name = "Basic"
              [32m+[0m[0m tier = "Basic"
            }
        }
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m ignore_casing             = false
      [32m+[0m[0m ignore_missing_property   = true
      [32m+[0m[0m location                  = "northeurope"
      [32m+[0m[0m locks                     = []
      [32m+[0m[0m name                      = "mbprj-int-aih010"
      [32m+[0m[0m output                    = (known after apply)
      [32m+[0m[0m parent_id                 = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/tfmodule-test-rg"
      [32m+[0m[0m removing_special_chars    = false
      [32m+[0m[0m response_export_values    = []
      [32m+[0m[0m schema_validation_enabled = false
      [32m+[0m[0m tags                      = {
          [32m+[0m[0m "test" = "aistudioproject"
        }
      [32m+[0m[0m type                      = "Microsoft.MachineLearningServices/workspaces@2024-04-01"

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.setup.module.ai_studio_hub.azurerm_private_endpoint.private_endpoint_ai_studio_hub[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_ai_studio_hub" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprj-int-aih010-amlworkspace-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprj-int-aih010-amlworkspace-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprj-int-aih010-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprj-int-aih010-amlworkspace-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "amlworkspace",
            ]
        }
    }

[1m  # module.setup.module.ai_studio_hub.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "0s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.setup.module.application_insights.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_application_insights" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.application_insights.azurerm_application_insights.application_insights[0m will be created
[0m  [32m+[0m[0m resource "azurerm_application_insights" "application_insights" {
      [32m+[0m[0m app_id                                = (known after apply)
      [32m+[0m[0m application_type                      = "web"
      [32m+[0m[0m connection_string                     = (sensitive value)
      [32m+[0m[0m daily_data_cap_in_gb                  = 100
      [32m+[0m[0m daily_data_cap_notifications_disabled = false
      [32m+[0m[0m disable_ip_masking                    = false
      [32m+[0m[0m force_customer_storage_for_profiler   = false
      [32m+[0m[0m id                                    = (known after apply)
      [32m+[0m[0m instrumentation_key                   = (sensitive value)
      [32m+[0m[0m internet_ingestion_enabled            = true
      [32m+[0m[0m internet_query_enabled                = true
      [32m+[0m[0m local_authentication_disabled         = false
      [32m+[0m[0m location                              = "northeurope"
      [32m+[0m[0m name                                  = "mbprj-int-ai001"
      [32m+[0m[0m resource_group_name                   = "tfmodule-test-rg"
      [32m+[0m[0m retention_in_days                     = 90
      [32m+[0m[0m sampling_percentage                   = 100
      [32m+[0m[0m tags                                  = {
          [32m+[0m[0m "test" = "aistudioproject"
        }
      [32m+[0m[0m workspace_id                          = "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-logging-rg/providers/Microsoft.OperationalInsights/workspaces/ptt-dev-log001"
    }

[1m  # module.setup.module.container_registry.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_container_registry[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_container_registry" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.container_registry.azurerm_container_registry.container_registry[0m will be created
[0m  [32m+[0m[0m resource "azurerm_container_registry" "container_registry" {
      [32m+[0m[0m admin_enabled                 = false
      [32m+[0m[0m admin_password                = (sensitive value)
      [32m+[0m[0m admin_username                = (known after apply)
      [32m+[0m[0m anonymous_pull_enabled        = false
      [32m+[0m[0m data_endpoint_enabled         = false
      [32m+[0m[0m encryption                    = (known after apply)
      [32m+[0m[0m export_policy_enabled         = false
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m login_server                  = (known after apply)
      [32m+[0m[0m name                          = "mbprjintacr001"
      [32m+[0m[0m network_rule_bypass_option    = "AzureServices"
      [32m+[0m[0m network_rule_set              = [
          [32m+[0m[0m {
              [32m+[0m[0m default_action = "Deny"
            },
        ]
      [32m+[0m[0m public_network_access_enabled = false
      [32m+[0m[0m quarantine_policy_enabled     = false
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m retention_policy_in_days      = 7
      [32m+[0m[0m sku                           = "Premium"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }
      [32m+[0m[0m trust_policy_enabled          = false
      [32m+[0m[0m zone_redundancy_enabled       = false

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.setup.module.container_registry.azurerm_private_endpoint.container_registry_private_endpoint[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "container_registry_private_endpoint" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprjintacr001-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprjintacr001-registry-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprjintacr001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.azurecr.io",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprjintacr001-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "registry",
            ]
        }
    }

[1m  # module.setup.module.container_registry.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "0s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.setup.module.key_vault.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.key_vault.azurerm_key_vault.key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault" "key_vault" {
      [32m+[0m[0m access_policy                   = []
      [32m+[0m[0m enable_rbac_authorization       = true
      [32m+[0m[0m enabled_for_deployment          = false
      [32m+[0m[0m enabled_for_disk_encryption     = false
      [32m+[0m[0m enabled_for_template_deployment = false
      [32m+[0m[0m id                              = (known after apply)
      [32m+[0m[0m location                        = "northeurope"
      [32m+[0m[0m name                            = "mbprj-int-kv001"
      [32m+[0m[0m public_network_access_enabled   = false
      [32m+[0m[0m purge_protection_enabled        = true
      [32m+[0m[0m resource_group_name             = "tfmodule-test-rg"
      [32m+[0m[0m sku_name                        = "standard"
      [32m+[0m[0m soft_delete_retention_days      = 7
      [32m+[0m[0m tags                            = {
          [32m+[0m[0m "test" = "aistudioproject"
        }
      [32m+[0m[0m tenant_id                       = "37963dd4-f4e6-40f8-a7d6-24b97919e452"
      [32m+[0m[0m vault_uri                       = (known after apply)

      [32m+[0m[0m contact (known after apply)

      [32m+[0m[0m network_acls {
          [32m+[0m[0m bypass         = "AzureServices"
          [32m+[0m[0m default_action = "Deny"
        }
    }

[1m  # module.setup.module.key_vault.azurerm_private_endpoint.private_endpoint_cognitive_account_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_cognitive_account_vault" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprj-int-kv001-vault-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprj-int-kv001-vault-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprj-int-kv001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprj-int-kv001-vault-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "vault",
            ]
        }
    }

[1m  # module.setup.module.key_vault.azurerm_role_assignment.current_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "8e97b9a3-4714-4ed4-b1a6-66638c5dd940"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Administrator"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.setup.module.key_vault.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "0s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.setup.module.storage_account.data.azurerm_monitor_diagnostic_categories.diagnostic_categories_storage_account[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_storage_account" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = (known after apply)
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["blob"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprjintstg001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprjintstg001-blob-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprjintstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprjintstg001-blob-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["file"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprjintstg001-file-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprjintstg001-file-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprjintstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprjintstg001-file-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "file",
            ]
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["queue"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprjintstg001-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprjintstg001-queue-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprjintstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprjintstg001-queue-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.setup.module.storage_account.azurerm_private_endpoint.private_endpoint_storage_account["table"][0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "private_endpoint_storage_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mbprjintstg001-table-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mbprjintstg001-table-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "tfmodule-test-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/1fdab118-1638-419a-8b12-06c9543714a0/resourceGroups/ptt-dev-networking-rg/providers/Microsoft.Network/virtualNetworks/spoke-ptt-dev-vnet001/subnets/TerraformTestSubnet"
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mbprjintstg001-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/e82c5267-9dc4-4f45-ac13-abdd5e130d27/resourceGroups/ptt-dev-privatedns-rg/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mbprjintstg001-table-svc"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "table",
            ]
        }
    }

[1m  # module.setup.module.storage_account.azurerm_role_assignment.current_roleassignment_storage_blob_data_owner[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "current_roleassignment_storage_blob_data_owner" {
      [32m+[0m[0m description                      = "Required for creating data plane artifacts"
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "8e97b9a3-4714-4ed4-b1a6-66638c5dd940"
      [32m+[0m[0m principal_type                   = "ServicePrincipal"
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Storage Blob Data Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.setup.module.storage_account.azurerm_storage_account.storage_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_storage_account" "storage_account" {
      [32m+[0m[0m access_tier                        = "Hot"
      [32m+[0m[0m account_kind                       = "StorageV2"
      [32m+[0m[0m account_replication_type           = "LRS"
      [32m+[0m[0m account_tier                       = "Standard"
      [32m+[0m[0m allow_nested_items_to_be_public    = false
      [32m+[0m[0m allowed_copy_scope                 = "AAD"
      [32m+[0m[0m cross_tenant_replication_enabled   = false
      [32m+[0m[0m default_to_oauth_authentication    = true
      [32m+[0m[0m dns_endpoint_type                  = "Standard"
      [32m+[0m[0m https_traffic_only_enabled         = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m infrastructure_encryption_enabled  = true
      [32m+[0m[0m is_hns_enabled                     = false
      [32m+[0m[0m large_file_share_enabled           = false
      [32m+[0m[0m local_user_enabled                 = true
      [32m+[0m[0m location                           = "northeurope"
      [32m+[0m[0m min_tls_version                    = "TLS1_2"
      [32m+[0m[0m name                               = "mbprjintstg001"
      [32m+[0m[0m nfsv3_enabled                      = false
      [32m+[0m[0m primary_access_key                 = (sensitive value)
      [32m+[0m[0m primary_blob_connection_string     = (sensitive value)
      [32m+[0m[0m primary_blob_endpoint              = (known after apply)
      [32m+[0m[0m primary_blob_host                  = (known after apply)
      [32m+[0m[0m primary_blob_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_blob_internet_host         = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_blob_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_connection_string          = (sensitive value)
      [32m+[0m[0m primary_dfs_endpoint               = (known after apply)
      [32m+[0m[0m primary_dfs_host                   = (known after apply)
      [32m+[0m[0m primary_dfs_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_dfs_internet_host          = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_dfs_microsoft_host         = (known after apply)
      [32m+[0m[0m primary_file_endpoint              = (known after apply)
      [32m+[0m[0m primary_file_host                  = (known after apply)
      [32m+[0m[0m primary_file_internet_endpoint     = (known after apply)
      [32m+[0m[0m primary_file_internet_host         = (known after apply)
      [32m+[0m[0m primary_file_microsoft_endpoint    = (known after apply)
      [32m+[0m[0m primary_file_microsoft_host        = (known after apply)
      [32m+[0m[0m primary_location                   = (known after apply)
      [32m+[0m[0m primary_queue_endpoint             = (known after apply)
      [32m+[0m[0m primary_queue_host                 = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_queue_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_table_endpoint             = (known after apply)
      [32m+[0m[0m primary_table_host                 = (known after apply)
      [32m+[0m[0m primary_table_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m primary_table_microsoft_host       = (known after apply)
      [32m+[0m[0m primary_web_endpoint               = (known after apply)
      [32m+[0m[0m primary_web_host                   = (known after apply)
      [32m+[0m[0m primary_web_internet_endpoint      = (known after apply)
      [32m+[0m[0m primary_web_internet_host          = (known after apply)
      [32m+[0m[0m primary_web_microsoft_endpoint     = (known after apply)
      [32m+[0m[0m primary_web_microsoft_host         = (known after apply)
      [32m+[0m[0m public_network_access_enabled      = false
      [32m+[0m[0m queue_encryption_key_type          = "Account"
      [32m+[0m[0m resource_group_name                = "tfmodule-test-rg"
      [32m+[0m[0m secondary_access_key               = (sensitive value)
      [32m+[0m[0m secondary_blob_connection_string   = (sensitive value)
      [32m+[0m[0m secondary_blob_endpoint            = (known after apply)
      [32m+[0m[0m secondary_blob_host                = (known after apply)
      [32m+[0m[0m secondary_blob_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_blob_internet_host       = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_blob_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_connection_string        = (sensitive value)
      [32m+[0m[0m secondary_dfs_endpoint             = (known after apply)
      [32m+[0m[0m secondary_dfs_host                 = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_dfs_internet_host        = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_dfs_microsoft_host       = (known after apply)
      [32m+[0m[0m secondary_file_endpoint            = (known after apply)
      [32m+[0m[0m secondary_file_host                = (known after apply)
      [32m+[0m[0m secondary_file_internet_endpoint   = (known after apply)
      [32m+[0m[0m secondary_file_internet_host       = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_endpoint  = (known after apply)
      [32m+[0m[0m secondary_file_microsoft_host      = (known after apply)
      [32m+[0m[0m secondary_location                 = (known after apply)
      [32m+[0m[0m secondary_queue_endpoint           = (known after apply)
      [32m+[0m[0m secondary_queue_host               = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_queue_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_table_endpoint           = (known after apply)
      [32m+[0m[0m secondary_table_host               = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_endpoint = (known after apply)
      [32m+[0m[0m secondary_table_microsoft_host     = (known after apply)
      [32m+[0m[0m secondary_web_endpoint             = (known after apply)
      [32m+[0m[0m secondary_web_host                 = (known after apply)
      [32m+[0m[0m secondary_web_internet_endpoint    = (known after apply)
      [32m+[0m[0m secondary_web_internet_host        = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_endpoint   = (known after apply)
      [32m+[0m[0m secondary_web_microsoft_host       = (known after apply)
      [32m+[0m[0m sftp_enabled                       = false
      [32m+[0m[0m shared_access_key_enabled          = true
      [32m+[0m[0m table_encryption_key_type          = "Account"
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "test" = "aistudioproject"
        }

      [32m+[0m[0m blob_properties {
          [32m+[0m[0m change_feed_enabled      = false
          [32m+[0m[0m default_service_version  = (known after apply)
          [32m+[0m[0m last_access_time_enabled = false
          [32m+[0m[0m versioning_enabled       = false

          [32m+[0m[0m container_delete_retention_policy {
              [32m+[0m[0m days = 7
            }

          [32m+[0m[0m cors_rule {
              [32m+[0m[0m allowed_headers    = [
                  [32m+[0m[0m "*",
                ]
              [32m+[0m[0m allowed_methods    = [
                  [32m+[0m[0m "DELETE",
                  [32m+[0m[0m "GET",
                  [32m+[0m[0m "HEAD",
                  [32m+[0m[0m "POST",
                  [32m+[0m[0m "OPTIONS",
                  [32m+[0m[0m "PUT",
                  [32m+[0m[0m "PATCH",
                ]
              [32m+[0m[0m allowed_origins    = [
                  [32m+[0m[0m "https://mlworkspace.azure.ai",
                  [32m+[0m[0m "https://ml.azure.com",
                  [32m+[0m[0m "https://*.ml.azure.com",
                  [32m+[0m[0m "https://ai.azure.com",
                  [32m+[0m[0m "https://*.ai.azure.com",
                ]
              [32m+[0m[0m exposed_headers    = [
                  [32m+[0m[0m "*",
                ]
              [32m+[0m[0m max_age_in_seconds = 1800
            }

          [32m+[0m[0m delete_retention_policy {
              [32m+[0m[0m days                     = 7
              [32m+[0m[0m permanent_delete_enabled = false
            }
        }

      [32m+[0m[0m network_rules {
          [32m+[0m[0m bypass                     = [
              [32m+[0m[0m "AzureServices",
            ]
          [32m+[0m[0m default_action             = "Deny"
          [32m+[0m[0m ip_rules                   = (known after apply)
          [32m+[0m[0m virtual_network_subnet_ids = (known after apply)
        }

      [32m+[0m[0m queue_properties (known after apply)

      [32m+[0m[0m routing {
          [32m+[0m[0m choice                      = "MicrosoftRouting"
          [32m+[0m[0m publish_internet_endpoints  = false
          [32m+[0m[0m publish_microsoft_endpoints = false
        }

      [32m+[0m[0m sas_policy {
          [32m+[0m[0m expiration_action = "Log"
          [32m+[0m[0m expiration_period = "1.00:00:00"
        }

      [32m+[0m[0m share_properties (known after apply)
    }

[1m  # module.setup.module.storage_account.time_sleep.sleep_connectivity[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "sleep_connectivity" {
      [32m+[0m[0m create_duration = "0s"
      [32m+[0m[0m id              = (known after apply)
    }

[1mPlan:[0m 23 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>